package equipment;

public class Shield extends Equipment{
// 装備したとき防御ができる
// 少しだけDEFが上がる

	// =======================
	// フィールド変数
	// =======================

	// =======================
	// コンストラクタ
	// =======================
	public Shield(String name,int probability) {
		super(name,probability);}

	// =======================
	// Getter / Setter
	// =======================

	// =======================
	// protected メソッド
	// =======================

	// =======================
	// private メソッド
	// =======================

	// =======================
	// public メソッド
	// =======================

}
